<template>
<div class="protocol-box">
    <!-- 头部 start -->
    <header-view :back="true" title="会员协议"></header-view>
    <!-- 头部 end -->
    <div class="protocol-center">
        <section>
            <p class="indent">欢迎您使用蜜果会员收费充值服务。蜜果提供的网络服务采用收费与免费结合的方式。您须先成为蜜果普通用户之后，才能继续进行购买服务。通过购买程序支付费用后，您就可以轻松享受蜜果会员服务。为使用蜜果会员充值服务，您应当阅读并遵守《蜜果会员充值服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的相应条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。 除非您已阅读并接受本协议所有条款，否则您无权使用蜜果会员充值服务（以下简称“本服务”）。您对本服务的任何购买、查看等使用行为即视为您已阅读并同意本协议的约束。 如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</p>
        </section>
        <section>
            <span>一、协议条款的确认和接受</span>
            <p class="indent">1.1、在您决定购买会员之前，请仔细阅读本收费协议条款。您必须在完全同意以下条款的前提下，才能进行购买程序。蜜果将根据以下收费协议条款为您提供收费服务。您在享受蜜果会员服务时必须完全、严格遵守本收费协议条款。</p>
            <p class="indent">1.2、蜜果根据互联网的发展和中华人民共和国有关法律、法规的变化，不断地完善服务质量并依此修改服务条款。蜜果有权就本协议随时更新，且毋须另行通知。您的权利以及义务的表述、购买程序及收费标准，均以最新的服务条款为准。您如果不同意该条款的修改并不影响已发生责任及义务的承担；如果您在条款变更后继续访问或使用蜜果，则视为您已经接受对本协议的修改。</p>
            <p class="indent">1.3、只有您根据提示确认其愿意支付相关费用，并通过本协议约定方式中的一种方式支付费用后，您才能使用蜜果会员。如您拒绝支付该等费用，则不能使用会员服务。</p>
            <p class="indent">1.4、对于未明确授权给您的其他服务的权利、收益由蜜果或相关权利人所有。</p>
            <p class="indent">1.5、您一旦购买蜜果提供的会员服务，即视为您是符合中华人民共和国法律规定的具有完全民事权利能力和完全民事行为能力及能够独立承担民事责任的自然人，并了解及完全同意本网站的《用户协议》及本收费协议的各项内容，以及蜜果对《用户协议》及本协议随时所做的任何修改。</p>
            <p class="indent">1.6、本收费协议中未约定事项以《用户协议》中的约定为准。</p>
        </section>
        <section>
            <span>二、风险及责任</span>
            <p class="indent">2.1、您须对其自身在使用蜜果所提供的服务时的一切行为、行动（不论是否故意）负全部责任。</p>
            <p class="indent">2.2、您明确了解并同意，约定的付费方式为代收费运营商托收的付款方式，您通过此种付费方式付费可能存在一定的商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均会给您造成相应的经济损失。为此，您同意蜜果在充分履行其在本协议项下全部义务及勤勉谨慎义务的前提下不对您的前述风险和损失承担任何责任；并且，蜜果不承担向不法分子追究侵权责任或者代其向您承担损失的任何责任和义务。</p>
            <p class="indent">2.3、您对本服务条款及修改有任何异议，可自动放弃其资格，但不退还任何已缴纳的收费视频费用。</p>
        </section>
        <section>
            <span>三、收费标准</span>
            <p>3.1、一旦您购买了蜜果的会员，即视为您认可会员服务标明之价格；您购买成功后，会员服务即时生效。</p>
            <p>3.2、收费费用标准：具体会员服务的收费标准以会员页面标价为准</p>
            </p>
        </section>
        <section>
            <span>四、购买步骤</span>
            <p>4.1、对于具体购买操作步骤，蜜果会在相关页面上做每一步的明确提示。</p>
            <p>4.2、费用支付：会员收费费用将在您点击购买之日按照收费标示价格通过支付宝、微信等第三方代收费的方式支付。</p> 
            <p>4.3、一旦您在蜜果购买会员服务成功后，则蜜果将即时收取会员服务的费用，并不提供退费服务。</p>
        </section>
        <section>
            <span>五、变更及免责条款</span>
            <p>5.1、蜜果对会员服务周期、购买价格保留随时变更的权利，而不需通知您。对于所有服务的中断或终止而造成的任何损失，蜜果无需对您或任何第三方承担任何责任。</p>
            <p>5.2、鉴于网络服务的特殊性，您同意蜜果有权随时变更、中断或终止部分或全部的网络服务。蜜果保留随时修改或中断服务而不需通知您的权利，对于所有服务的中断或终止而造成的任何损失，蜜果无需对您或任何第三方承担任何责任。</p> 
            <p>5.3、对于因服务器的死机、网络的故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗拒的事由，包括但不限于政府行为、自然灾害、黑客攻击等造成的服务中断和对您个人数据及资料造成的损失，蜜果不承担由此对您造成的任何损失或退还任何已缴纳的收费服务费用。但蜜果应尽可能事先进行通告。</p>
            <p>5.4、您购买的服务视频使用期限中包含解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间蜜果不予补偿。</p>
            <p>5.5、蜜果对任何直接、间接、偶然、特殊及继起的损害不负责任，不予赔偿。</p>
            <p>5.6、您在使用蜜果所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，不论原因如何，蜜果均不负责任。由于您与他人共享帐户，由此导致的任何个人资料泄露，蜜果不负任何责任。</p>
        </section>
        <section>
            <span>六、中断及终止服务 </span>
            <p> 6.1、如您违反本服务条款中的内容，蜜果有权在不通知您的情况下立即终止您已购买的会员服务，以及取消您的蜜果账户和使用权限，但不退还任何已缴纳的费用。</p>
        </section>
        <section>
            <span>七、隐私权政策</span>
            <p>蜜果非常重视用户个人信息的保护，在您使用蜜果提供的服务时，您同意蜜果按照在蜜果平台上公布的隐私权政策收集、存储、使用、披露和保护您的个人信息。蜜果希望通过隐私权政策向您清楚地介绍蜜果对您个人信息的处理方式，因此蜜果建议您完整地阅读隐私权政策，以帮助您更好地保护您的隐私权。</p>
        </section>
    </div>
</div>
</template>

<script>
import HeaderView from '@/components/modules/Header.vue';
export default {
    name: 'protocol',
    components: {
        HeaderView,
    }
};
</script>

<style lang="scss" scoped>
.protocol-box {
	margin-bottom: 0.6rem;
}
.protocol-center {
    padding: 0 0.16rem;
    .title {
        text-align: center;
        color: #212121;
        font-size: 0.2rem;
        font-family: 'DroidSansFallback';
        font-weight: normal;
        margin-top: 0.2rem;
    }
    section {
        font-family: 'PingFangSC-Regular';
        margin: 0.14rem 0;
        > span {
            font-size: 0.112rem;
            color: #333333;
        }
        > p {
            font-size: 0.093rem;
            color: #666666;
            text-indent: 0.13rem;
            margin-top: 0.14rem;
        }
        > p.indent {
            text-indent: 0.23rem;
        }
        > p.second-level {
            text-indent: 0;
            margin: 0;
            > span {
                display: inline-block;
                text-indent: 0.13rem;
                width: 100%;
            }
        }
        > p.three-level {
                text-indent: 0;
                margin: 0;
                > span {
                    display: inline-block;
                    text-indent: 0.25rem;
                    width: 100%;
                }
            }
    }
    section.six-color p {
        color: #151515;
    }
}

</style>
